In [1]:
# for mathemaical operations
import numpy as np
# for dataframe manipulations
import pandas as pd

In [2]:
data = pd.read_excel('SSGB.xlsx')
data.shape

(1486, 6)

In [3]:
data.head()

        Date Councellor Name Course Type Fees Received Fees Total Fees Pending
0 2020-04-01          Manish    SSGB LVC          5000       5000            0
1 2020-04-01          Manish    SSGB LVC          5000       5000            0
2 2020-04-01          Manish    SSGB LVC          5000       5000            0
3 2020-04-01          Manish    SSGB LVC          5000       5000            0
4 2020-04-01          Manish    SSGB LVC          5000       5000            0

In [4]:
data.isnull().sum()

Date                16
Councellor Name     49
Course Type         57
Fees Received       52
Fees Total          56
Fees Pending       572
dtype: int64

In [5]:
data['Councellor Name'].value_counts()

Manish             290
Naveen             126
Ruby               107
Ankit              104
Tarun               92
Abhishek            84
Vipin               81
Samreen             81
Abhishek C          64
Akansha             57
Sonam               57
Simran              53
Priyanka            52
Khalid              50
Nimra               34
Sakshi              21
Suyal               20
Vineeta             18
akansha             15
Deepender           12
vipin                5
Sonali               4
Deepti               3
Pankaj               3
Ujjal                2
Consultant           1
Councellor Name      1
Name: Councellor Name, dtype: int64

In [6]:
indexNames = data[ (data['Councellor Name'] == 'Councellor Name') | (data['Councellor Name'] == 'Consultant')].index
# Delete these row indexes from dataFrame
data.drop(indexNames , inplace=True)

In [7]:
data['Councellor Name'].value_counts()

Manish        290
Naveen        126
Ruby          107
Ankit         104
Tarun          92
Abhishek       84
Samreen        81
Vipin          81
Abhishek C     64
Akansha        57
Sonam          57
Simran         53
Priyanka       52
Khalid         50
Nimra          34
Sakshi         21
Suyal          20
Vineeta        18
akansha        15
Deepender      12
vipin           5
Sonali          4
Deepti          3
Pankaj          3
Ujjal           2
Name: Councellor Name, dtype: int64

In [8]:
data['Course Type'].value_counts()

SSGB            786
SSGB LVC        452
SSGBLVC          26
PMP              15
SS GB            12
               ...
SSGB & BA         1
SSGB-Tableau      1
SSGB & CAPM       1
SSGB+MW           1
SAP-MM            1
Name: Course Type, Length: 91, dtype: int64

In [9]:
data = data[data['Councellor Name'].notna() & data['Course Type'].notna()]

In [10]:
data.isnull().sum()

Date                 0
Councellor Name      0
Course Type          0
Fees Received        1
Fees Total           4
Fees Pending       525
dtype: int64

In [11]:
data = data[data['Fees Received'].notna() & data['Fees Total'].notna()]

In [12]:
data.isnull().sum()

Date                 0
Councellor Name      0
Course Type          0
Fees Received        0
Fees Total           0
Fees Pending       521
dtype: int64

In [13]:
data.shape

(1421, 6)

In [14]:
data.head()

        Date Councellor Name Course Type Fees Received Fees Total Fees Pending
0 2020-04-01          Manish    SSGB LVC          5000       5000            0
1 2020-04-01          Manish    SSGB LVC          5000       5000            0
2 2020-04-01          Manish    SSGB LVC          5000       5000            0
3 2020-04-01          Manish    SSGB LVC          5000       5000            0
4 2020-04-01          Manish    SSGB LVC          5000       5000            0

In [15]:
data.tail()

,Date,Councellor Name,Course Type,Fees Received,Fees Total,Fees Pending
1465,2021-07-01,Priyanka,SSGB,8500,8500,NaN
1466,2021-07-01,Ankit,SSGB,15750,15750,NaN
1467,2021-07-01,Samreen,CBAP,16350,16350,NaN
1468,2021-07-01,Sonam,SSGB,14225,14225,NaN
1469,2021-07-01,Sonali,SSGB,10500,10500,NaN

In [16]:
data['Fees Pending'].value_counts()

0                                            882
6125                                           3
10000                                          2
9000                                           1
4400                                           1
dues cleared in oct by naveen, coloumn 43      1
dues cleared in OCT by Naveen. coloumn 44      1
7500                                           1
6000                                           1
5000                                           1
14750                                          1
3500                                           1
Dues cleared by Naveen in Oct ssgb             1
-8500                                          1
12500                                          1
12000                                          1
Name: Fees Pending, dtype: int64

In [17]:
data=data.drop(['Fees Pending'], axis = 1)

In [18]:
data.isnull().sum()

Date               0
Councellor Name    0
Course Type        0
Fees Received      0
Fees Total         0
dtype: int64

In [19]:
data.shape

(1421, 5)

In [20]:
data.head()

        Date Councellor Name Course Type Fees Received Fees Total
0 2020-04-01          Manish    SSGB LVC          5000       5000
1 2020-04-01          Manish    SSGB LVC          5000       5000
2 2020-04-01          Manish    SSGB LVC          5000       5000
3 2020-04-01          Manish    SSGB LVC          5000       5000
4 2020-04-01          Manish    SSGB LVC          5000       5000

In [21]:
data['Course Type'].value_counts()

SSGB                 783
SSGB LVC             450
SSGBLVC               26
PMP                   15
SS GB                 12
                    ...
MBB                    1
SSGB-                  1
Digital Marketing      1
SSGB & PMP             1
CFAP                   1
Name: Course Type, Length: 90, dtype: int64

In [22]:
data=data.replace(to_replace ="SSGBLVC",
                 value ="SSGB LVC")

In [23]:
data['Course Type'].value_counts()

SSGB                 783
SSGB LVC             476
PMP                   15
SS GB                 12
RPA                   11
                    ...
MBB                    1
SSGB-                  1
Digital Marketing      1
SSGB & PMP             1
CFAP                   1
Name: Course Type, Length: 89, dtype: int64

In [24]:
data=data.replace(to_replace ="SS GB",
                 value ="SSGB")

In [25]:
data['Course Type'].value_counts()

SSGB                 795
SSGB LVC             476
PMP                   15
RPA                   11
SSGB+Advn Excel        7
                    ...
SSGB-                  1
Digital Marketing      1
SSGB & PMP             1
CDCDW                  1
CFAP                   1
Name: Course Type, Length: 88, dtype: int64

In [26]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1421 entries, 0 to 1469
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             1421 non-null   datetime64[ns]
 1   Councellor Name  1421 non-null   object
 2   Course Type      1421 non-null   object
 3   Fees Received    1421 non-null   int64
 4   Fees Total       1421 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 66.6+ KB

In [27]:
pd.to_numeric(data['Fees Total'])

0        5000
1        5000
2        5000
3        5000
4        5000
        ...
1465     8500
1466    15750
1467    16350
1468    14225
1469    10500
Name: Fees Total, Length: 1421, dtype: int64

In [28]:
data.describe()

       Fees Received    Fees Total
count    1421.000000   1421.000000
mean    11990.006334  12141.816327
std      4012.912465   4034.610304
min         0.000000      0.000000
25%     10000.000000  10000.000000
50%     12000.000000  12000.000000
75%     14000.000000  14000.000000
max     40000.000000  40000.000000

In [29]:
data.isnull().sum()

Date               0
Councellor Name    0
Course Type        0
Fees Received      0
Fees Total         0
dtype: int64

In [30]:
data.shape

(1421, 5)

In [31]:
data['year'] = pd.DatetimeIndex(data['Date']).year
data['month'] = pd.DatetimeIndex(data['Date']).month

In [32]:
data.head()

,Date,Councellor Name,Course Type,Fees Received,Fees Total,year,month
0,2020-04-01,Manish,SSGB LVC,5000,5000,2020,4
1,2020-04-01,Manish,SSGB LVC,5000,5000,2020,4
2,2020-04-01,Manish,SSGB LVC,5000,5000,2020,4
3,2020-04-01,Manish,SSGB LVC,5000,5000,2020,4
4,2020-04-01,Manish,SSGB LVC,5000,5000,2020,4

In [33]:
data.tail()

,Date,Councellor Name,Course Type,Fees Received,Fees Total,year,month
1465,2021-07-01,Priyanka,SSGB,8500,8500,2021,7
1466,2021-07-01,Ankit,SSGB,15750,15750,2021,7
1467,2021-07-01,Samreen,CBAP,16350,16350,2021,7
1468,2021-07-01,Sonam,SSGB,14225,14225,2021,7
1469,2021-07-01,Sonali,SSGB,10500,10500,2021,7

In [34]:
file_name = 'SSGB_modified.xlsx'

In [35]:
data.to_excel(file_name)